{"0": "Did you know that Staryu can effortlessly regenerate any appendage it loses in battle? As long as the center section of this Pokémon is unharmed, it can grow back fully, even if it is chopped to bits. Lumineon and other fish Pokémon nibble on Staryu, but thanks to its red core, it regenerates so fast that it’s unconcerned by their snack attacks!", "1": "Did you know that Dustox is instinctively drawn to light? Swarms of this Pokémon are attracted by the bright lights of cities, where they wreak havoc by stripping the leaves off roadside trees for food. They tend to gather in the glow of streetlamps at night!", "2": "Did you know that Woobat emits ultrasonic waves from its nose to learn about its surroundings? This Pokémon’s habitat are dark forests and caves, and the suction from its nostrils enables it to stick to cave walls while it sleeps, leaving a heart-shaped mark behind. This heart-shaped mark left on a body after a Woobat has been attached to it is said to bring good fortune!", "3": "Did you know that each Stakataka appears to be made up of many life-forms stacked one on top of each other? Appearing from the Ultra Wormhole, this brute's true identity was this mysterious life-form, which brings to mind an Ultra Beast. When this stone wall Pokémon starts to move and attack, its eyes turn red!", "4": "Did you know that Mothim loves the honey of flowers and steals honey collected by Combee? This Pokémon flies over fields and mountains in constant search of floral honey, and while it loves the sweet honey, it won’t gather any itself. It flutters around at night to steal the honey from the Combee hive!", "5": "Did you know that Garbodor absorbs garbage and makes it part of their bodies? Consuming garbage makes new kinds of poison gases and liquids inside their bodies, and the main component of the poison depends on what sort of trash was eaten. When fighting, it clenches opponents with its left arm and finishes them off with foul-smelling poison gas belched from its mouth!", "6": "Did you know that Charjabug’s digestive processes convert the leaves it eats into electricity? From the food it digests, it generates electricity, and it stores this energy in its electric sac. On camping trips, people are grateful to have one around, but if you accidentally step on one, you’ll get a shock!", "7": "Did you know that Frosmoth shows no mercy to any who desecrate fields and mountains? This Pokémon will fly around on its icy wings, causing a blizzard to chase offenders away. The temperature of its wings is less that -290 degrees Fahrenheit!", "8": "Did you know that Whismur’s voice is normally very quiet? A very timid Pokémon, Whismur usually murmurs, but starts crying loudly if it senses danger. It cries equal a jet plane in volume, and because it inhales through its ear canals, it can cry continually without having to catch its breath!", "9": "Did you know that Doduo makes up for its poor flying with its fast foot speed? Leaving giant footprints, this Pokémon runs at high speed on its well-developed legs, alternately raising and lowering its two heads to balance itself while running. If it sees an enemy, it runs away at 60 mph!", "10": "Did you know that if you are burned by the flames Houndoom shoots from its mouth, the pain will never go away? This pungent-smelling flame that shoots from its mouth is a result of toxins burning in its body, and it breathes these flames when it gets angry. When it lets out its eerie howls, other Pokémon get the shivers and head straight back to their nests!", "11": "Did you know that as Fennekin walks, it munches on a twig in place of a snack? Eating a twig fills this Pokémon with energy, and its roomy ears give vent to air hotter than 390 degrees Fahrenheit. It intimidates opponents by puffing this hot air from its ears!", "12": "Did you know that with ninja-like agility and speed, Scyther can create the illusion that there is more than one? With movements that look like that of a ninja, this Pokémon moves too fast for the human eye to track. It moves so fast that its opponent does not even know what knocked it down!", "13": "Did you know that when its body temperature goes up, Cryogonal turns into steam and vanishes? Born in snow clouds, this Pokémon is composed of ice crystals, and are almost never seen during summer. When its temperature lowers back down, it returns to ice!", "14": "Did you know that it is said that time began moving when Dialga was born? A legendary Pokémon of Sinnoh, it has the power to control time, and it’s said that time flows when Dialga’s heart beats. This Pokémon uses its power to travel at will through the past and future!", "15": "Did you know that Porygon2 is the upgraded version of Porygon designed for space exploration? Although it can’t fly, this manmade Pokémon evolved from the latest technology and has been endowed with artificial intelligence that enables it to learn new gestures and emotions on its own. Sometimes, it may exhibit motions that were not programmed!", "16": "Did you know that the scars on Seviper’s body are evidence of vicious battles? This Pokémon will not give up its long-running blood feud with Zangoose that has continued on for generations, as the two Pokémon are eternal rivals. During these heated rival battles, Seviper uses its blade tail to counter any Zangoose!", "17": "Did you know that when Toucannon battles, its beak heats up? Within its beak, its internal gas ignites, explosively launching seeds with enough power to pulverize boulders. The temperature can easily exceed 212 degrees Fahrenheit, causing severe burns when it hits!", "18": "Did you know that Copperajah came over from another region long ago and worked together with humans? These Pokémon live in herds, and their trunks have incredible grip strength; strong enough to crush giant rocks into powder. Their green skin is resistant to water!", "19": "Did you know that Sandshrew burrow deep underground in arid locations far from water? This Pokémon dislikes water, and prefers to live in dry, sandy places because it uses the sand to protect itself when threatened. Sandshrew’s body is configured to absorb water without waste, enabling it to survive in arid deserts!", "20": "Did you know that Litleo are hot-blooded Pokémon are quick to fight? This Pokémon live with a pride when they’re young, but once they’re able to hunt prey on their own, they’re kicked out and have to make their own way. The stronger the opponent it faces, the more heat surges from its mane and the more power flows through its body!", "21": "Did you know that the special membrane enveloping Alomomola has the ability to heal wounds? When they find a wounded Pokémon, they gently hold the injured and weak Pokémon in its fins and heal their wounds, carefully bringing it to shore. Fishermen take them along long voyages, because if you have an Alomomola with you, there’ll be no need for a doctor or medicine!", "22": "Did you know that its abdomen is a honeycomb for grubs? This Pokémon raises its grubs on honey and nectar collected by Combee, and it releases various pheromones to make the grubs in its body do its bidding while fighting foes. When endangered, grubs from its six-cell honeycomb strike back!", "23": "Did you know that Kirlia uses the horns on its head to amplify its psychokinetic power? This Pokémon controls psychokinetic powers with its highly developed brain, and when it uses its power, the air around it becomes distorted, creating mirages of nonexistent scenery. A single Kirlia has the psychic power to create a rip in the dimensions and see into the future!", "24": "Did you know that Quilava is fully covered by nonflammable fur? Able to withstand any kind of fire attack, this Pokémon keeps its foes at bay with the intensity of its flames and gusts of superheated air. Be careful if it turns it back during battle, as it means that it will attack with the fire on its back!", "25": "Did you know that since ancient times, Solgaleo has been honored as an emissary of the sun? In writings from the distant past, this Pokémon was called by the name “the beast that devours the sun”, and energy in the form of light radiates boundlessly from it. The intense light it radiates from the surface of its body can make the darkest of nights light up like midday!", "26": "Did you know that Staraptor will courageously challenge foes that are much larger? A Pokémon with a savage nature, Staraptor never stops attacking, even if its injured. The muscles in its wings and legs are so strong that it can easily fly while gripping a small Pokémon!", "27": "Did you know that because its wings aren’t yet fully grown, Natu has to hop to get around? This Pokémon is extremely good at climbing tree trunks and likes to eat the new sprouts on the trees, and it usually forages for food on the ground but may, on rare occasions, hop onto branches to peck at shoots. Natu can flap and leap onto tree branches that are taller than grown-up people to pick at the tree’s new shoots!", "28": "Did you know that Krabby’s pincers are not only powerful weapons, they are used for balance when walking sideways? These pincers are superb weapons that sometimes break off during battle, but they grow back fast. If it loses a pincer, it somehow becomes incapable of walking sideways!", "29": "Did you know that Gossifleur anchors itself in the ground with its single leg, then basks in the sun? Preferring lands with clean water and air, this Pokémon’s pollen has a healing effect. After absorbing enough sunlight, its petals spread as it blooms brilliantly!", "30": "Did you know that Haxorus can be very kind, but are relentless when defending their territory? These Pokémon are covered in hard armor and wield incredibly destructive tusks, which can easily slice through a thick, sturdy steel column. It licks up dirt to take in the minerals it needs to keep its tusks in top condition!", "31": "Did you know that in seasons without snow, such as spring and summer, Snorunt steals away to live quietly among stalactites and stalagmites deep in caverns? A Pokémon that lives in regions with heavy snowfall and survives by eating only snow and ice, Snorunt is capable of withstanding cold of minus 150 degrees Fahrenheit. In snowy regions, it is said that when they are seen late at night, snowfall will arrive by morning!", "32": "Did you know that when its in danger, Meowstic raises its ears and releases enough psychic power to grind a 10-ton truck into dust? The eyeball patterns on the interior of its ears emit psychic energy, and it keeps the patterns tightly covered because that power is too immense. Male and female Meowstic not only have a physical difference, but the females are a bit more selfish and aggressive than the males!", "33": "Did you know that despite their elegant appearance, Swanna can flap their wings strongly and fly for thousands of miles? This Pokémon is also capable of administering sharp, powerful pecks with its bill and can whip its long neck to deliver forceful repeated strikes. At dusk, Swanna will begin to dance, and the one dancing in the center is the leader of the flock! ", "34": "Did you know that in order to keep themselves from being blown away by the wind, Hoppip will gather in clusters? This Pokémon’s body is so light that it must grip the ground firmly with its feet in order to keep from being blown away, and it can be carried away on even the gentlest breeze. If it senses the approach of strong winds, Hoppip will link its leaves with other Hoppip to prepare against being blown away!", "35": "Did you know that Probopass can freely control the small units around it? These units are called Mini-Noses, and Probopass can control them using its own magnetic force, allowing it to attack a foe from three directions. Probopass radiates such a powerful magnetic field that nearby electrical appliances become unusable!", "36": "Did you know that during the daytime, Cacturne remains unmoving so that it does not lose any moisture to the harsh desert sun? This Pokémon becomes active at night when the temperature drops, and if a traveler is going through a desert in the thick of night, Cacturne will follow in a ragtag group. If you are that traveler, be careful, as they are biding their time and waiting for you to tire and become incapable of moving!", "37": "Did you know that when in a hurry, Hitmonlee’s legs lengthen progressively? This Pokémon has an awesome sense of balance and can kick in succession from any position, using its elastic legs to execute every known kick. Also called the “Kick Master”, the sole of Hitmonlee’s feet turn as hard as diamond on impact to destroy its enemy!", "38": "Did you know that Nickit survives off its ill-gotten gains? Cunning and cautious, this Pokémon survives by stealing food from others, erasing its tracks with swipes of its tail as it makes off with its plunder. Aided by the soft pads on its feet, Nickit silently raids the food stores of other Pokémon!", "39": "Did you know that witnesses have observed Celesteela flying across the sky at high speeds? One of the dangerous Ultra Beasts, other people have also witnessed this Pokémon burn down a forest by expelling gas from its two arms. High energy readings can be detected coming from both of its huge arms!", "40": "Did you know that Dugtrio are actually triplets that emerged from one body? This team of Diglett triplets can burrow at over 60 mph, and due to this, some people think its an earthquake. Extremely powerful, they can dig through even the hardest ground!", "41": "Did you know that Combee is a Pokémon formed by three others? This trio is together from birth, and at night, they cluster to form a beehive and sleep. This giant hive is usually comprised of 100 Combee!", "42": "Did you know that although it is a good climber, Ursaring prefers to snap trees with its forelegs and eat fallen berries? This Pokémon walks through its forest gathering food every day, and with its ability to distinguish any aroma, Ursaring unfailingly finds all food buried deep underground. In its territory, it leaves scratches on trees that bear delicious berries or fruits!", "43": "Did you know that a Frillish paralyzes its prey with poison? By using the invisible poison spikes on its veil like arms and legs, this Pokémon paralyzes its enemies and causes them to drown. If it wraps its prey in its arms, that foe will be dragged miles below the surface, never to return!", "44": "Did you know that although its body is small, Hawlucha’s proficient fighting skills enable it to keep up with big bruisers like Machamp and Hariyama? In combat, this Pokémon leaps nimbly about, taking advantage of its opponents’ blind spots. It drives its opponents to exhaustion with its agile maneuvers, then ends the fight with a flashy finishing move!", "45": "Did you know that Masquerain intimidates enemies with the eyelike patterns on its antennas? These antennas have eyelike patterns that usually give it an angry look, but if the intimidation doesn’t work, it deftly makes its escape on its set of four wings. If the “eyes” are droopy and appear sad, it is said to be a sign that heavy rainfall is on its way!", "46": "Did you know that the seeds attached to Eldegoss’ cotton fluff are full of nutrients? This Pokémon spreads these seeds on the wind so that plants and other Pokémon can benefit from them, making the soil in the Galar region rich with nutrients. Eldegoss’ cotton fluff also can be spun into a glossy, gorgeous yarn!", "47": "Did you know that Starmie’s central core glows with the seven colors of the rainbow? This Pokémon is nicknamed “The Gem of the Sea”, and many people value its core as a gem and make them into high-priced accessories that are traded in secret. When this core is glowing, Starmie is unleashing its potent psychic powers!", "48": "Did you know that Blitzle use their flashing manes to communicate with one another? This mane shines when it discharges electricity, and it can even catch and store lightning with its mane. When thunderclouds cover the sky, Blitzle will appear!", "49": "Did you know that a single Electivire can provide enough electricity for all the buildings in a big city for a year? In terms of electrical energy, this Pokémon is one of the best among all Electric Pokémon, discharging high-voltage currents from its tails. When battling, Electivire pushes the tips of its two tails against the foe, then lets loose with over 20,000 volts of power!", "50": "Did you know that the light that Lanturn emits is so bright that it can illuminate the sea’s surface from a depth of over three miles? This Pokémon produces light by causing a chemical reaction between bacteria and its bodily fluids inside the antenna, and uses that light to lure in its prey before blinding it with a bright flash. Lanturn is nicknamed “The Deep-Sea Star” because of its illuminated antenna!", "51": "Did you know that Aron eats iron to build its steel body? To make its body, Aron feeds on iron ore that it digs from mountains, and occasionally causes major trouble by eating bridges and rails. When it evolves, Aron sheds the steel carapace that covered its whole body and develops a new one!", "52": "Did you know that with its sharp fangs, Yungoos will bite anything? This Pokémon wanders around in a never-ending search for food, and although it will eat anything, it prefers fresh living things. Yungoos’ stomach takes up most of its long torso!", "53": "Did you know that Goodra attacks with its retractable horns? While normally a very friendly Pokémon, its main form of offense is forcefully stretching out its horns, but it also throws heavy punches and swings its thick tail. The strikes from its horns land 100 times harder than any blow from a heavyweight boxer!", "54": "Did you know that Tyranitar is powerful enough to change the landscape? This Pokémon is so overwhelmingly powerful that it can bring down a whole mountain to make its nest. In just one of its mighty hands, it has the power to make the ground shake and mountains crumble!", "55": "Did you know that Rapidash is a very competitive Pokémon? This Pokémon will chase anything that moves fast in hopes of racing it, giving chase at top speed if it spots something moving faster than itself. With incredible acceleration, it reaches its top speed of 150 mph after just ten steps!", "56": "Did you know that Dracovish’s powerful legs and jaws made it the apex predator of its time? Its mighty legs are capable of running at speeds exceeding 40 mph, but unfortunately, this Pokémon can’t breathe unless its underwater. Its own overhunting of its prey was what drove it to extinction!", "57": "Did you know that Tsareena can knock out even kickboxing champions with a single blow? A master of grand and beautiful kicks, this Pokémon is well known for the beauty of its well-shaped legs. A kick from the hardened tips of Tsareena’s legs leaves a wound in the opponent’s body and soul that will never heal?", "58": "Did you know that Lopunny is an extremely cautious Pokémon? If it senses danger, it cloaks its body with its fluffy ear fur and quickly bounds off. Constantly monitoring its surroundings, this Pokémon delivers super destructive kicks to protect itself!", "59": "Did you know that groups of Scrafty will beat up anything that enters their territory? With the ability to smash concrete with its kicking attack, this Pokémon has a certain territory that it never leaves its whole life long. While mostly known for having the temperament of an aggressive ruffian, Scrafty takes very good care of its family, friends and territory!", "60": "Did you know that Aggron claims an entire mountain as its own territory? This Pokémon vigilantly patrols its territory at all times, and mercilessly beats up anything that violates its environment. If its mountain is ravaged by a landslide or a fire, Aggron will haul topsoil to the area, replant trees and beautifully restore its own territory!", "61": "Did you know that while it uses psychic powers, it is not known if Psyduck intends to do so? Always tormented by headaches, if these headaches peak, they begin to exhibit odd and mysterious powers. Unfortunately, Psyduck can never remember these episodes, spurring controversy among scholars!", "62": "Did you know that Ducklett are excellent divers? This Pokémon swims around in the water earing their favorite food -- peat moss. When they are attacked, Ducklett uses its feathers to splash water, escaping under cover of the spray!", "63": "Did you know that Budew is sensitive to temperature changes? Over the winter, this Pokémon closes its bud and endures the cold. When the warm spring arrives, the bud reopens and releases pollen that induces harsh sneezing and runny noses!", "64": "Did you know that Goomy is the weakest Dragon-type Pokémon? If this Pokémon dries out, it will be unable to breathe and die, so it sticks to shady, damp places. As soon as Goomy pick up any sign of enemies, they immediately go into hiding, leading to their prolonged survival!", "65": "Did you know that when Incineroar’s fighting spirit is set alight, the flames around its waist become especially intense? A Pokémon with a violent and selfish disposition, it hurls ferocious punches and flings furious kicks at its opponents. If finishes its opponents off by spewing fire from around its navel!", "66": "Did you know that Cufant can dig up the ground with its trunk? A very strong Pokémon, Cufant is capable of carrying leads of over five tons without any problem at all. If a job requires strength, this Pokémon will excel at it!", "67": "Did you know that Ampharos has been treasured since ancient times as a beacon? Well known as the Light Pokémon, this Pokémon acts as a beacon for lost people. Ampharos gives off so much light that it can be seen even from space!", "68": "Did you know that strong electricity courses through the tips of Luxio’s sharp claws? These claws can loose electricity with enough amperage to cause fainting, even from a the slightest scratch. They rest their forelegs on others of its group to communicate with rhythmic electric pulses from its claws!", "69": "Did you know that Cloyster’s innards have never been seen? Once this Pokémon    slams its shell shut, it is impossible to open, even by those with superior strength. Cloyster’s shell is harder than diamonds and cannot be shattered, even by a bomb!", "70": "Did you know that Honedge attaches itself to people and drinks their life force? If anyone dares to grab its hilt, it wraps a blue cloth around that person’s arm and drains that person’s life energy completely. It’s said that the blue eye on the sword’s handguard is the true body of Honedge!", "71": "Did you know that by putting power into its bumps, Seismitoad can create vibrations and increase the power of its punches? They can not only use these vibrations to hurt their opponents, this   Pokémon can also shoot paralyzing liquid from the bumps on their head. The power behind their punches can turn a boulder to rubble with a single punch!", "72": "Did you know that Marshadow never appears before humans? Able to conceal itself in any shadow, its very existence is the stuff of myth, so it went undiscovered for a long time. By slipping into the shadow of a martial arts master and copying their movements, this Pokémon learned the ultimate techniques!", "73": "Did you know that no matter how many times it is knocked down, Makuhita will continue to get up and attack its foe? A very tenacious Pokémon, Makuhita has a tireless spirit that will never give up hope, and it grows stronger by enduring harsh training. Every time it gets back up, this Pokémon stores more energy in its body for evolving!", "74": "Did you know that when Grookey uses its special stick to strike up a beat? With rapid beats of its stick, the sound waves produced by this beat carry revitalizing energy to the plants and flowers in the area. As it strikes with amazing speed, it gets more and more pumped!", "75": "Did you know that by inhaling deeply, Wigglytuff can continue to inflate itself without limit? When angered, it will suck in air and inflate itself to an enormous size and hit their target with a body slam. Once inflated, Wigglytuff bounces along lightly like a balloon!", "76": "Did you know that earning a Litten’s trust takes time? This Pokémon doesn’t allow its emotions to be easily seen, as it prefers solitude. Trying to pet Litten before it trusts you will result in a nasty scratch from its sharp claws!", "77": "Did you know that Swinub rubs its snout on the ground to find and dig up food? If this Pokémon smells something enticing, it dashes headlong off to find the source of the aroma, and its nose is so tough that even frozen ground poses no problem. Swinub occasionally roots out hot springs!", "78": "Did you know that Grumpig uses the black pearls on its body to amplify its psychic power waves for gaining total control over its foe? When this Pokémon uses its special power, its snorting breath grows labored and it dances bizarrely by doing odd steps. It’s dancing style became hugely popular overseas!", "79": "Did you know that as they grow, Timburr carry bigger logs? This Pokémon appears at building sites to help out, and it loves the work so much that if it rains, it swings its log around and throws a tantrum. Timburr that have started to carry logs that are about three times their size are nearly ready to evolve!", "80": "Did you know that Weavile sends signals to others by carving odd patterns in frost-covered trees and ice? Living in cold regions, this Pokémon forms groups of four or five that hunt prey with impressive coordination, carving signs into boulders as well as trees and ice. They bring their prey down with carefully coordinated attacks!", "81": "Did you know that the thick shell on Chespin’s head can protect it from a direct hit from a truck? While the quills on its head are usually soft, when it flexes them, the points become so hard and sharp that they can pierce rock. Despite having a curious nature that tends to get it in trouble, Chespin keeps an optimistic outlook and does not worry about small details!", "82": "Did you know that on nights around the quarter moon, the aurora from Cresselia’s tail extends and undulates beautifully? Said to represent the crescent moon, shiny particles are released from its wings like a veil, giving it the power to dispel nightmares. Those who sleep holding Cresselia’s feathers are assured of joyful dreams!", "83": "Did you know that Greedent will stash berries in its tail? Known as the Greedy Pokémon, this Pokémon will hoard berries within its massive tail - so many that they constantly fall out. With its strong teeth and determination, Greedent can chew through the toughest of berry shells!", "84": "Did you know that Archeops runs better than it flies? To be able to take off, this Pokémon first sprints across the ground at 25 miles per hour, building speed over a course of about 2.5 miles. With its weak wing muscles, Archeops was much better at hunting on the ground than in the sky!", "85": "Did you know that Bewear possesses overwhelming physical strength? A very dangerous Pokémon in Alola, their habitats are generally off-limits, and there are signs posted around its home to warn others. With its bone-crushing strength, many Trainers have left this world after their spines were squashed by its hug!", "86": "Did you know that the large pincer Kingler has is as hard as steel? This large pincer has 10,000 horsepower of crushing power, but because of its size and weight, this Pokémon quickly tires out from using it. Kingler will wave this huge claw in the air to communicate with others!", "87": "Did you know that Exploud can trigger earthquakes with the tremors it creates by bellowing? This Pokémon's howls can be heard over six miles away, so if it inhales violently from all the ports on its body, it's preparing to let loose a huge bellow. While known for these bellows, Exploud only raises its voice when it is in battle!", "88": "Did you know that Sentret stands on its tail so it can see a long way out? A very cautious Pokémon, if it spots an enemy, it cries loudly to warn its kind. When this Pokémon becomes separated from its pack, it becomes incapable of sleep due to fear!", "89": "Did you know that Spiritomb was bound to a fissure in an odd keystone as punishment for its misdeeds? Its constant mischief and misdeeds resulted in being bound to the Odd Keystone my a mysterious spell, trapping the 108 souls within. All Spiritomb’s mischief compelled a traveler to bind it nearly 500 years ago!", "90": "Did you know that Anorith lived in the ocean about 100,000,000 years ago? Regenerated from a prehistoric fossil, this primitive Pokémon once lived in warm seas, hunting its prey using its two large claws. It swims by undulating the eight wings at its sides!", "91": "Did you know that when Araquanid’s belly is full, it stores its subdued prey in the water bubble on its head? It has a habit of storing things in its water bubble, and small Pokémon get sucked into the bubble where they drown. If its Trainer doesn’t watch out, Araquanid will try to put them in its bubble!", "92": "Did you know that Bergmite uses cold air to repair any cracks with new ice? Using air of -150 degrees Fahrenhait, they freeze opponents solid, freezing water in the air into ice that they use as armor. It secures itself to the back of an Avalugg by freezing its feet in place!", "93": "Did you know that if you step on a Geodude by accident, it gets angry? Found in fields and mountains, this Pokémon is often mistaken for a boulder, and as a result, people often step or trip on them. Most people might not notice them, but a closer look would reveal that there are many Geodude around!", "94": "Did you know that Stunfisk smiles when transmitting electricity? Thanks to bacteria that lived in the mud flats with it, this Pokémon developed the organs it uses to generate electricity. When its opponent can’t be paralyzed, it contorts itself with unexpected speed and flops away!", "95": "Did you know that Regidrago’s body is composed of crystallized dragon energy? An academic theory proposes that Regidrago’s arms were once the head of an ancient dragon Pokémon, but the theory remains unproven thus far. Regidrago is said to have the powers of every dragon Pokémon!", "96": "Did you know that every time a Magby inhales or exhales, hot embers dribble out of its mouth? A Magby’s state of health it determined by observing the fire it breaths; if it’s spouting yellow flames from its mouth, it’s in good health. When it is fatigued, black smoke will be mixed in with the flames!", "97": "Did you know that a Gothita’s ribbonlike feelers increase their psychic power? Though they’re still only babies, there’s psychic power stored in their ribbonlike feelers, and sometimes use that power to fight. Because they’re always staring at something, many believe it’s speaking to something only they can see!", "98": "Did you know that Lurantis pretends to be a bug Pokémon for self-protection? This Pokémon resembles a beautiful flower, and it requires a lot of effort to maintain Lurantis’s vivid colors, but some collectors enjoy this work and treat it as their hobby. A properly raised Lurantis will have gorgeous, brilliant colors!", "99": "Did you know that Clefable is rarely seen? With its acute hearing, it can pick up sounds from far away, and as a result, it prefers to live in quieter places. It will run and hide the moment it senses people!", "100": "Did you know that Roselia shoots sharp thorns as projectiles at any opponent that ties to steal the flowers on its arm? These flowers give off a relaxing fragrance, bringing serenity to living things. The stronger the aroma, the healthier the Roselia is!", "101": "Did you know that sunlight colors Cherubi red? It turns red as it gathers sunlight, stockpiling the nutrients in both its body and the small red ball it carries with it. This small ball holds the nutrients a Cherubi needs for evolution!", "102": "Did you know that Hoopa sends anything and everything to faraway places using its loop? This loop can warp space, allowing this Pokémon to gather things it likes and pass them through the loop to teleport them to a secret place. Legends of its avarice tell how it once carried off an entire castle to gain the treasure hidden within!", "103": "Did you know that Arcanine is considered a legendary Pokémon in China? A Pokémon that has been admired since the past for its beauty, many people are charmed by its grand mane. With a bark conveys a sense of majesty, anyone who hears it can’t help but grovel before it!", "104": "Did you know that despite its small size, Pichu can zap even adult humans? Not yet skilled at storing electricity, it may send out a jolt if amused or startled. When Pichu plays with others, it may short out electricity with another Pichu, creating a shower of sparks!", "105": "Did you know that Luxray has eyes that can se through anything? When its eyes gleam gold, it can spot hiding prey - even those taking shelter behind a wall. Seeing through solid objects uses up a lot of Luxray’s electricity, so the Pokémon sleeps for long periods of time to store up energy!", "106": "Did you know that Grubbin’s strong jaw enables it to scrape trees and slurp out the sap? Normally living underground, they often gather near places frequented by electric Pokémon in order to avoid being attacked by bird Pokémon. Its natural enemy, like Rookidee, may flee rather than risk getting caught in its large mandibles that can snap thick tree branches!", "107": "Did you know that the swirl pattern in Sinistea’s body is its weakness? Absorbing the life-force of those who drink it, this Pokémon waits patiently for people to take a sip, but it tastes so bad that it gets spat out immediately. If it gets stirred, the swirl loses its shape, and Sinistea gets dizzy!", "108": "Did you know that Shelmet only evolves when bathed in electric-like energy along with Karrablast? This reason behind this strange physiology is still unknown, and with their natural enemy being Karrablast, it makes it difficult to study this phenomenon. Although when the two of them evolve, their heated rivalry seems to disappear along with it!", "109": "Did you know that Shedinja’s body is a discarded shell that came to life? Merely a hollow shell, this Pokémon’s hard body doesn’t move - not even a twitch. Peering into the crack on its back is said to steal one’s spirit away!", "110": "Did you know that blades comprise Pawniard’s entire body? As group hunters, this Pokémon will cling to their prey and inflict damage by sinking their blades into it, ignoring their own injuries for the sake of the group. If battling dulls the blades, it will sharpen them on stones by the river!", "111": "Did you know that Naganadel stores hundreds of liters of poisonous liquid inside its body? One of the organisms known as an Ultra Beast, this Pokémon can fire glowing, venomous liquid from its needles. The liquid that it can shoot is also immensely adhesive!", "112": "Did you know that Girafarig’s tail has a small brain of its own? This tail may bite on its own if it notices an alluring smell, and might also lash out at certain sounds. This tail actually doesn’t need to sleep, so it can keep watch over their surroundings 24 hours a day!", "113": "Did you know that Magnemite is born with the ability to defy gravity? Using anti-gravity to stay suspended, this Pokémon floats in air on powerful electromagnetic waves, and the electricity emitted by the units on each side of its body cause it to become a strong magnet. Magnemite becomes incapable of flight if its internal electrical supply is depleted!", "114": "Did you know that the fire that Magmortar launches from its arms is over 3,600 degrees Fahrenheit? Living in the crater of a volcano has caused this Pokémon’s body to resemble its environment - it has an organ similar to a magma chamber. Its arm will actually start to melt when it fires a whole barrage!", "115": "Did you know that Gourgeist wander town streets on the night of the new moon? Singing in eerie voices, anyone who hears their song will be cursed. It also sings joyfully as it observes the suffering of its prey!", "116": "Did you know that Blipbug has hairs on its body that it uses to asses its surroundings? Often found in gardens, Blipbug isn’t a very strong Pokémon, as it spends its time constantly collects information. This Pokémon is incredibly intelligent because of all the information it gathers!", "117": "Did you know that Shroomish are often found keeping still under fallen leaves? This Pokémon lives in damp soil in the dark depths of forests, feeding on compost that is made up of fallen, rotted leaves. If you enter a forest after a long rain, you can see many Shroomish feasting on composted soil!", "118": "Did you know that groups of Mankey will attack any handy target for no reason? An agile Pokémon that is extremely quick to anger, Mankey will not hesitate to attack anything. It’s unsafe to approach if it gets violently enraged for no reason, as it can’t distinguish friends from foes!", "119": "Did you know that when it needs to think, Noctowl rotates its head 180 degrees to sharpen its intellectual power? With eyes that are specially adapted, they can concentrate even faint light and enable it to see in the dark. Noctowl never fails to catch prey in the darkness!", "120": "Did you know that Minccino greet each other by grooming one another thoroughly with their tails? These Pokémon prefer a tidy habitat, they are always sweeping and dusting, using their tails as brooms. A clean freak that will not allow even the slightest mess, it uses its tail like a mop to thoroughly clean any and all filth!", "121": "Did you know that light is apparently the source of Necrozma’s energy? If this Pokémon doesn’t devour light, impurities build up in it and on it, and Necrozma darkens and stops moving. After a long time spent slumbering underground, impurities accumulated within it, causing its body to darken!", "122": "Did you know that a pair of Pachirisu may been seen rubbing their cheeks pouches together in an effort to share stored electricity? This Pokémon makes electricity with pouches in its cheeks, and shoots the charges from its tail. Even the fur balls it makes crackle with static electricity!", "123": "Did you know that although Pangoro possesses a violent temperament, it won’t put up with any bullying? This Pokémon boasts superb physical strength, and its arms are mighty enough to snap a telephone pole. Those who wish to become Pangoro’s Trainer have no choice but to converse with their fists!", "124": "Did you know that through meditation, Medicham can heighten the energy inside its body to sharpen its sixth sense? Through the power of meditation, Medicham developed its sixth sense and gained the ability to use psychokinetic powers. This Pokémon is known to meditate for a whole month without eating!", "125": "Did you know that Scraggy’s skin has a rubber elasticity so it can reduce damage? This   Pokémon protects itself by pulling its saggy skin up to its neck, and its thought that Scraggy evolves once its skin has completely stretched out. The saggier the skin the more respect they garner from their peers!", "126": "Did you know that Eiscue keeps its heat-sensitive head cool with ice? It keeps its head iced constantly to make sure it stays nice and cold, drifting on the flow of ocean waters from frigid places. It fished for foot by dangling its single hair into the ice to lure in prey!", "127": "Did you know that Exeggutor’s three heads think independently? While its three heads think about whatever they like, they use telepathy to discuss their plants before coming to a joint conclusion. Even though they are three separate heads, they appear to be friendly and never squabble!", "128": "Did you know that the end of Marill’s tail serves as a buoy that keeps it from drowning? The tip of its tail, which contains oil that is lighter than water, allows it to swim without drowning, even in a vicious current. If you see just its tail bobbing on the water’s surface, it’s a sure indication that this Pokémon is diving beneath the water to feed on aquatic plants!", "129": "Did you know that be catching the aura emanating from others, Lucario can read their thoughts and movements? As the Aura Pokémon, it has the ability to sense the aura of all things, and a well-trained Lucario can sense auras to identify and take in the feelings of creatures over half a mile. It’s said that no foe can remain invisible to Lucario, since it can detect their aura!", "130": "Did you know that Mudsdale will remain calm and unmoving no matter the situation? Known for its powerful body and emotional fortitude, Mudsdale never cries out, no matter what kind of trouble it’s in, and defeats its opponents with a single powerful kick. Mudsdale has so much stamina that it can trudge mountain roads without rest for three days and three nights, all while dragging a 10-ton load!", "131": "Did you know that Kadabra emits special alpha waves from its body that induce headaches just by being close? Possessing strong spiritual powers, many odd things happen if this Pokémon is nearby, like making clocks run backwards. When it closes its eyes, twice as many alpha particles come out of the surface of its body!", "132": "Did you know that after long exposure to sunlight, the patterns on Finneon’s tail shine vividly when darkness arrives? The line running down its side can store sunlight, and it will stay near the surface during the day to absorb as much sunlight as they can. Since they’re popular with divers, there are resorts that feed them to keep them close!", "133": "Did you know that Armaldo’s enormous, retractable claws can cut through most anything? With the power to punch right through a steel slab, it skewers prey with its claws to feed. Though it lives on land, it hunts for prey by diving beneath the ocean!", "134": "Did you know that when spotted, Dunsparce will escape backwards by furiously boring into the ground with its tail? With a drill for its tail, this Pokémon will use its tail to burrow into the ground backwards. Dunsparce is known to make its nest in complex shapes deep under the ground!", "135": "Did you know that by changing the direction in which it rotates, Klang can communicate its feelings to others? A minigear and big gear comprise its body, and it will spin the minigears at high speeds and fire them away. When angry, it rotates faster!", "136": "Did you know that Applin spends its entire life inside an apple? As soon as this Pokémon is born, it burrows into an apple to hide from its natural enemies: bird Pokémon. When it spots a bird Pokémon, Applin will pretend to be an apple and nothing more!", "137": "Did you know that Dedenne sneaks into people’s homes and steals electricity from their outlets? It uses its tail to absorb electricity from power plants or from outlets in houses, and then it fires the electricity from its whiskers. The reason it steals electricity from others is because Dedenne can’t generate much electricity on its own!", "138": "Did you know that Golem can easily withstand dynamite blasts without damage? It boulder-like body is extremely hard, but once it sheds its skin, its body turns tender and white. It sheds its skin once a year, and the discarded shell immediately hardens and crumbles away!", "139": "Did you know that there are always 48 fangs lining Croconaw’s mouth? Once a Croconaw has clamped its jaws on its foe, it will absolutely not let go, and because the tips of its fangs are slanted backward, the prey has no hope of escaping. If it loses any fangs while biting, new ones will grow back in their place!", "140": "Did you know that Boltund can run nonstop for three full days? This Pokémon generates electricity through its legs and can channel it through its legs to keep them going strong and boost their strength. When running at top speeds, it easily breaks 50 mph!", "141": "Did you know that Bounsweet’s body gives off a sweet, fruity scent that is extremely appetizing to bird Pokémon? Because of its sweet, delicious aroma, bird Pokémon are always after it, and often times are swallowed whole by Toucannon lured by that wafting deliciousness. It tries to resist being swallowed by a bird Pokémon by spinning the sepal on its head!", "142": "Did you know that Swablu loves to make things clean? If it spots something dirty, it will wipe and polish it with its cottony wings, and if it wings become dirty, this Pokémon finds a stream and showers itself. It can’t seem to relax if its surroundings aren’t clean!", "143": "Did you know that the reason why Foongus resembles a Poké Ball is currently unknown? For some reason, this Pokémon resembles a Poké Ball, and it lures people in with this pattern to release poisonous spores at them. The spores released from this Pokémon's hands are highly poisonous, but when thoroughly dried, the spores can be used as a stomach medicine!", "144": "Did you know that if any part Gastrodon’s body is torn off, it grows right back? Although this Pokémon has a pliable body without any bones, it apparently had a huge shell for protection in ancient times, shielding its entire back at one point. When it is attacked, it oozes purple fluid and escapes!", "145": "Did you know that Whirlipede spins itself rapidly and charges into its opponents? With its top speed is just over 60 mph, its spins its body like a wheel and crashes furiously into its enemies. Though it is usually motionless, when attacked, it will fight back using its poison spikes!", "146": "Did you know that Nidoking uses its powerful tail to smash, constrict, then break the prey’s bones? It swings its big tail around during battle, and if it binds an enemy, it can snap the victim’s spine quite easily. With one swing, Nidoking’s tail can topple a metal transmission tower!", "147": "Did you know that Trevenant will trap people who harm the forest so they can never leave? Using its roots as a nervous system, it can control the trees in the forest, devouring anyone daring to ravage the forest. Though it’s feared as a ghost of the forest, Trevenant is quite kind to the creatures that reside in its body!", "148": "Did you know that when nearby Pokémon hear the sound of Bruxish’s teeth gnashing, they sense danger and flee immediately? When emitting their psychic power, this Pokémon will grind its teeth as it waits for its prey to draw closer, and unfortunately for Bruxish, this sound is not very quiet. In the Alola region, lifeguards allow this Pokémon to remain in their area to prevent other, dangerous water Pokémon from gathering!", "149": "Did you know that though it barely moves, Dottler is still alive? The shell it wears is so heavy that it prevents this Pokémon from getting food to eat and water to drink, leaving very small holes to break through. As it grows inside its shell, it uses its psychic abilities to monitor the outside world and prepare for evolution!", "150": "Did you know that because it moves to quickly, Ninjask sometimes becomes unseeable? This Pokémon moves around at such a high speed that it cannot be seen, even while its crying can be clearly heard. Ninjask is so fast that it is said to be able to avoid any attack!", "151": "Did you know that people of the past used feathers fallen from Skarmory to make swords and knives? Though its sturdy wings look heavy, they are actually hollow and light, allowing it to fly freely. With its flight speed at close to 190 miles per hour, Skarmory slashes its foes with its wings that possess sword-like cutting edges!", "152": "Did you know that the dust-like scales covering Venomoth’s wings are color coded to indicate the kinds of poison it has? These powdery scales on its wings are hard to remove, and they also contain poison that leaks out on contact. When it attacks, it flaps its large wings violently to scatter its poisonous powder all around!", "153": "Did you know that despite its appearance, Bastiodon is a docile Pokémon? When attacked, this Pokémon will form a wall with their shield-like faces to protect their young, lined up side by side so no foe can break through. The bones of its face are huge and hard, so they were initially mistaken for its spine until this Pokémon was successfully restored!", "154": "Did you know that Swadloon protects itself from the cold by wrapping up in leaves? Forests where Swadloon live have superb foliage because the nutrients they make from fallen leaves nourish the plant life. Preferring dark, damp places, it spends the entire day eating fallen leaves that lie around it!", "155": "Did you know that Arrokuda is very proud of its jaw? If this Pokémon sees any movement around it, it will charge for it straightaway, leading with its sharply pointed jaw. After it’s eaten its fill, its movements become extremely sluggish!", "156": "Did you know that Barboach’s sensitive whiskers serve as a superb radar system? This Pokémon hides in the mud, leaving only two whiskers exposed so it can locate their prey, even in the murkiest of water. Barboach uses its whiskers to taste things just as a person uses their tongue!", "157": "Did you know that Sandygast takes control of anyone who puts a hand in its mouth? Born from a sand mound playfully built by a child, this Pokémon embodies the grudges of the departed. If you build sand mounds when you’re playing, destroy them before you go home, or they may get possessed and become Sandygast!", "158": "Did you know that Greninja creates throwing stars out of compressed water? This Pokémon toys with its enemies using swift movements, while slicing them with throwing stars of sharpest water.  When it spins them and throws them at high speed, these stars can split metal in two!", "159": "Did you know that on hunts, Tentacruel can extend its tentacles to ensnare and immobilize prey? While they are normally kept short, this Pokémon’s 80 tentacles can stretch and contract freely to entrap its opponents inside a poisonous net. To prevent its victims from escaping, Tentacruel doses them with a harsh toxin that causes poisoning and sharp, stabbing pain!", "160": "Did you know that Jellicent propel themselves by expelling absorbed seawater from their bodies? This Pokémon’s body is mostly seawater, and they are always hanging around fancy cruise ships and tankers, hoping to drag away its prey. Fishermen are terrified of Jellicent, as it’s been rumored that they will drag them into the sea and steal their lives away!", "161": "Did you know that Dubwool’s wool is extremely springy? If you choose to weave a carpet from this Pokémon’s wool, you’ll end up with something closer to a trampoline. The moment you set foot on the carpet, you’ll start to bounce!", "162": "Did you know that Oranguru normally spends its time meditating in the treetops? Known for its extreme intelligence, this Pokémon will look down on inexperienced Trainers, so it’s best suited to veteran Trainers. On rare occasions, it shows up at the beach to match wits with Slowking!", "163": "Did you know that Shellos’ body shape will vary depending on its environment? Living along bodies of water, its color and shapes differ from region to region, and in the Sinnoh region, two types are confirmed. Beware of pushing strongly on its squishy body, as it makes a mysterious purple fluid ooze out!", "164": "Did you know that as a result of its pursuit of faster, yet more silent flight, a new set of wings grew on Crobat’s hind legs? The development of these wings enables it to fly faster, but it also makes it tough to stop and rest. By alternately resting its front and rear wings, Crobat can fly all day without having to stop!", "165": "Did you know that Delcatty sleeps anywhere it wants without keeping a permanent nest? Rather than keeping a permanent lair, this Pokémon habitually seeks comfortable spots and sleeps there. Because Delcatty eats and sleeps whenever it decides, its daily routines are completely random!", "166": "Did you know that Pumpkaboo is said to carry wandering spirits to the place where they belong so that they can move on? This Pokémon's pumpkin body is inhabited by a spirit trapped in this world and as the sun sets, it becomes restless and active. The lights that stream out from the holes in the pumpkin can hypnotize and control the people and Pokémon that see it!", "167": "Did you know that Barraskewda’s jaw is as sharp as a spear? This Pokémon spins its tail fins to propel itself, surging forward at speeds of over 100 knots before ramming prey and spearing into them. Not only is Barraskewda’s jaw as sharp as a spear, it is also as strong as steel!", "168": "Did you know that rumors of Elgyem’s origin are linked to a UFO crash site in the desert 50 years ago? If this Pokémon stands near a TV, strange scenery will appear on the screen, and people believe these scenes are from its home. Before that UFO crash, this Pokémon had never been seen!", "169": "Did you know that what seems to be Froslass’ body is actually hollow? Legends in snowy regions say that a woman who was lost on an icy mountain was reborn as Froslass, her regret lingering on. When it finds humans or Pokémon it likes, it freezes them and takes them back to its chilly den, where they become decorations!", "170": "Did you know that because of its unusual, star-like silhouette, people believe that Cleffa came here on a meteor? Adding to the mystery, when numerous meteors illuminate the night sky, sightings of Cleffa strangely increase. On nights with many shooting stars, many of these Pokémon can be seen dancing in a ring!", "171": "Did you know that Buzzwole goes around showing off its abnormally swollen muscles? It shows off its body, but whether the display is a boast or a threat remains unclear to us. Witnesses say they saw this Pokémon pulverize a dump truck with a single punch!", "172": "Did you know that even thought its body is extremely skinny, Bellsprout is blindingly fast when catching its prey? If it notices anything that moves, it immediately flings its vine at the object, as it can't escape while its rooted into the ground. A Bellsprout’s thin and flexible body lets it bend and sway to avoid any attack!", "173": "Did you know that if Gliscor succeeds in catching even a faint breeze properly, it can circle the globe without flapping once? Its flight is soundless, dancing silently through the sky. When it approaches prey, it can land a critical hit in an instant!", "174": "Did you know that Klefki never lets go of a key that it likes? These key collectors threaten any attackers by fiercely jingling their keys at them, and although its unclear why it collects keys, giving it a key makes Klefki very happy. Because of its hoarding habit, people give it the keys to vaults and safes as a way to prevent crime!", "175": "Did you know that although it looks frightening, Snubbull is actually a very kind and affectionate Pokémon? By bearing its fangs and making a scary face, Snubbull sends smaller Pokémon scurrying away in terror. However, this Pokémon seems a little sad at making its foes flee!", "176": "Did you know that Carvanha’s strongly developed jaws and its sharply pointed fangs pack the destructive power to rip out boat hulls? Many boats have been attacked and sunk by this Pokémon, and if anything invades its territory, it will swarm and tear at the intruder with its pointed fangs. Strangely, when it’s on its own, Carvanha will suddenly turn timid!", "177": "Did you know that Mr. Rime is highly skilled at tap-dancing? Its amusing movements make it very popular, waving its cane of ice in time with its graceful movements. Due to these popular movements, Mr. Rime influences the Mime Jr.’s of Galar to learn its dancing steps, which leads them to evolve into their regional variants!", "178": "Did you know that Pyukumuku is covered in a slime that keeps its skin moist? This sticky mucous allows it to stay on land for days without drying up, and can also be used to soothe sunburned skin. Since these Pokémon tend to line the beaches, they make for a very convenient aloe!", "179": "Did you know that Leavanny dresses Sewaddle in clothes they made for it when it hatched? After that point, this Pokémon makes clothes for itself by chewing up leaves and sewing them with sticky thread extruded from its mouth. Since this Pokémon makes its own clothes out of leaves, it is a popular mascot for fashion designers!", "180": "Did you know that the organ that emits Espurr’s intense psychic power is sheltered by its ears to keep power from leaking out? While it has enough psychic energy to blast everything within 300 feet of itself, it has no control over its power. Though Espurr’s expression never changes, behind that blank stare is an intense struggle to contain its devastating psychic power!", "181": "Did you know that Gabite’s scales can be ground into a powder and used as raw materials for traditional medicine? In rare cases, it molts and sheds its scales, growing larger with each shedding. Medicine containing its scales as an ingredient will make a weary body feel invigorated!", "182": "Did you know that Seel relishes swimming in frigid climates? The light blue fur that covers its body keeps it protected against the cold, as this Pokémon loves iceberg-filled oceans. Seel are active even in the bitter cold of -40 degrees Fahrenheit!", "183": "Did you know that when it heats up, Centiskorch’s body temperature reaches about 1,500 degrees Fahrenheit? While its burning body is already dangerous on its own, this excessively hostile Pokémon also has large and very sharp fangs. During battle, it lashes its body like a whip and launches itself at enemies!", "184": "Did you know that when Shiinotic starts a fight for its territory against a Parasect, the entire area gets completely coated in spores? The spores that this Pokémon emits both lure their prey to their territory and cause drowsiness, and people confused by its strange lights can never find their way home again. Once it puts its prey to sleep, Shiinotic feeds on them by sucking their energy!", "185": "Did you know that every time Slowking yawns, the Shellder on its head injects more poison into it? When its head was first bitten by the Shellder, toxins entered Slowpoke’s head and unlocked an extraordinary power that made it more intelligent. The intelligence that Slowking has is comparable to that of an award-winning scientist!", "186": "Did you know that since Swalot has no teeth, it swallows whatever eat eats whole, no matter what? Its powerful stomach acid is capable of digesting almost anything it eats, and its mouth can open wide enough to easily fit an automobile tire. The one thing in the whole world that this Pokémon cannot digest is its own stomach!", "187": "Did you know that Barbaracle is made up of seven Binacle? Each with a mind of their own, they are capable of moving and acting independently, but they usually follow the head’s orders. In a pinch, its limbs will start to act on their own to ensure the enemy’s defeat!", "188": "Did you know that Ponyta’s hooves are 10 times harder than diamonds? Capable of jumping incredibly high, this Pokémon developed tough hooves and sturdy legs to absorb the impact of a hard landing. With its light body as well, Ponyta can clear Ayers Rock in one leap!", "189": "Did you know that when it appeared form the Ultra Wormhole, Xurkitree supposedly raided a power plant? According to the Aether Foundation, the cables that make up its body have been noted as being made of the same material as electrical wiring, and as such are highly efficient conductors for electricity. Its body contains an organ that produces energy, and it can discharge up to 1,000,000 volts at once!", "190": "Did you know that while each Pidove follows its Trainer’s orders as best it can, they sometimes fail to understand complicated commands? A very forgetful Pokémon, Pidove will wait for a new order from its Trainer even if it already has one. Even though it’s forgetful and not very bright, many Trainers love it anyway for its friendliness and sincerity!", "191": "Did you know that when agitated, Umbreon protects itself by spraying poisonous sweat from its pores? While it usually hides silently in darkness and waits for its opponents to make a move, this Pokémon will spray its poisonous sweat at its opponent’s eyes to blind them. The rings on its body glow when it leaps to attack!", "192": "Did you know that Grapploct’s body is made up of nothing but pure muscle? As a result, it makes the grappling moves this Pokémon performs with its tentacles extremely powerful. When searching for an opponent to test its skills against, it emerge onto land!", "193": "Did you know that Rampardos’ powerful head butt has enough power to shatter even the most durable things upon impact? One of the strongest physical attackers among Pokémon, its skull can withstand impacts of any magnitude. Unfortunately, as a result of these massive impacts and its thick skull, its brain never got a chance to grow!", "194": "Did you know that once a Rhyhorn starts its charge, it won’t stop running until it falls asleep? A Pokémon with a one-track mind, Rhyhorn can easily knock a trailer flying, uncaring of anything in its way. It is not even bothered if it rushes headlong into a block of steel, although it may feel some pain from the collision the next day!", "195": "Did you know that according to old tales, Phantump are stumps possessed by the spirits of children who died while lost in the forest? Preferring to live in abandoned forests, this Pokémon is created when spirits possess rotten tree stumps. By imitating the voice of a child, Phantump causes people to get hopelessly lost deep in the forest to make friends with them!", "196": "Did you know that Oricorio’s passionate dance moves cause its enemies to combust in both body and mind? It beats its wings together to create fire, and as it moves in the steps of its beautiful dance, it bathes opponents in intense flames. If its Trainer gives the wrong order, this passionate Pokémon becomes fiercely angry!", "197": "Did you know that red and blue Basculin get along so poorly that they’ll start fighting instantly? Very savage and hostile Pokémon, while they usually do not get along, there are some times that members of one school mingle with the other’s school. When a school of Basculin appears in a lake, everything else disappears except for Corphish and Crawdaunt!", "198": "Did you know that Numel stores magma of almost 2,200 degrees Fahrenheit within its body? When this Pokémon gets cold or wet, this magma cools and hardens, causing its movements to become sluggish and its body to get heavier. When it uses Fire-type moves, its humped back that stores the intensely hot magma gets smaller!", "199": "Did you know that as a result of storing too much electricity, Flaaffy developed patched where even downy wool won’t grow? This Pokémon’s wool quality changes so that it can generate a high amount of static electricity with a small amount of wool, as the bare and slick parts of its hide are shielded against electricity. If its coat becomes fully charged with electricity, its tail lights up!", "200": "Did you know that the iron helmet on Perrserker’s hair is not actually a helmet, but its hardened hair? With its violent and barbaric demeanor, this Pokémon lives for the thrill of battle, and after fighting in so many battles, it evolved dangerous claws that come together to form daggers when extended. Perrserker and Persian live in mutual disdain of each other, as their respective temperaments make for irreconcilable differences!", "201": "Did you know that if a Mudbray isn’t showered with mud on a daily basis, it gets stressed out and stops listening to its Trainer? Eating dirt, making mud, and playing in the mire all form a part of its daily routine, and the mud that sticks to Mudbray’s hooves enhances its grip and its powerful running gait. Possessing mighty power, this Pokémon can be loaded with 50 times its own body weight and it will be totally fine!", "202": "Did you know that Lumineon attracts its prey by flashing the patterns on its four tail fins? This Pokémon lives on the deep-sea floor, and to avoid detection by predators, it crawls along the seafloor using the two fins on its chest. Lumineon swimming in the darkness of the deep sea look like stars shining in the night sky!", "203": "Did you know that Clauncher knock down flying prey by firing compressed water from their massive claws? Through controlled explosions of internal gas, this Pokémon can expel water like a pistol shot. At close distances, these shots can even shatter rocks!", "204": "Did you know that Granbull is actually a Pokémon that is very timid and easily spooked? In spite of its appearance, Granbull doesn’t care for disputes, so it rarely has a chance to display its might. If attacked or startled, however, it flails about and bites with its huge fangs!", "205": "Did you know that according to an enduring legend, 9 noble saints were united and reincarnated as a Ninetales? Some other legends claim that each of its nine tails has its own unique type of special mystical power, since these tails are filled with wonderous energy that could keep this Pokémon alive for 1,000 years. Be careful not to grab these tails, though, as it could result in a 1,000-year curse!", "206": "Did you know that Joltik that live in cities have learned a technique for sucking electricity from the outlets in houses? This Pokémon is well known for attaching itself to large-bodied Pokémon and absorb static electricity, which they then store in an electric pouch. Since they cannot generate their own electricity, you can often find them sticking to a Yamper’s hindquarters!", "207": "Did you know that if two Nosepass meet, they cannot turn their faces to each other when they are close because their magnetic noses repel one another? This Pokémon has been said to be completely unmoving, with its magnetic nose pointed due north. However, close observation has revealed that Nosepass actually moves by a little over 3/8 of an inch every year!", "208": "Did you know that Poliwrath is such an adept swimmer that it can easily overtake the best human swimmers? Poliwrath’s highly developed, brawny muscles never grow fatigues, however much it exercises. It is so tirelessly strong that it can swim back and forth across the Pacific Ocean without effort!", "209": "Did you know that to entangle its opponents in battle, Swirlix extrudes white threads as sweet and sticky as cotton candy? Because it eats its own weight in sugar every day, this Pokémon’s fur is as sticky sweet as cotton candy. If it doesn’t get enough sugar, it becomes incredibly grumpy!", "210": "Did you know that due to the itch of its teething, Chewtle will snap its jaws at anything in front of it? When it battles, it starts by attacking with its rock-hard horn. But as soon as the opponent flinches, this Pokémon bites down and never lets go!", "211": "Did you know that Mismagius’ cry sounds like incantations? Those who hear these cries are usually tormented by headaches and hallucinations, although rarely some of these chants bring happiness. While normally feared for its wrath and the curses it spreads, this Pokémon will also, on a whim, cast spells that help people or make them fall in love!", "212": "Did you know that Roggenrola were first discovered a hundred years ago in an earthquake fissure? Born deep within the ground, it compares itself with similar species, such as Geodude and Carbink, to settle which has the hardest body. Since it is compressed underground, its body is as hard as steel!", "213": "Did you know that Scizor swings its eye-patterned pincers up to scare its foes? This Pokémon’s pincers, which contain steel, can crush any hard object it gets a hold of to bits. When Scizor raises its pincers to fight, it makes it look like it has three heads!", "214": "Did you know that while Wishiwashi is very small, the people of Alola seem to view it as a terrifying Pokémon? When it’s in trouble its eyes moisten and begin to shine, which is visible almost 25 miles away. These tears signals other Wishiwashi to gather!", "215": "Did you know that Machop trains in all styles of martial arts to become even stronger? This Pokémon loves to build its muscles and is very powerful, despite its small size. Machop is never satisfied, even if it trains hard all day long!", "216": "Did you know that the toxin made in Toxicroak’s poison sacs is pumped to the knuckle claws through tubes down its arms? This Pokémon stores its poison in the sac at its throat and when it croaks, the stored poison is churned for greater potency. This toxin can get so vile that even a scratch could prove fatal!", "217": "Did you know that because their bodies are enveloped in a special liquid, Solosis can survive in any environment? Its body is encapsulated in this liquid, but if it takes a heavy blow, the liquid will leak out. Many say that this special liquid would even allow Solosis to survive in the vacuum of space!", "218": "Did you know that after being reborn as a ghost, Dreepy wanders the areas it used to inhabit back when it was alive in prehistoric seas? If this weak Pokémon is by itself, a mere child could defeat it. However, if Dreepy has friends to help train it, it can evolve and become much stronger!", "219": "Did you know that after two Binacle find a suitably sized rock, they adhere themselves to it and live together? These two Pokémon will cooperate to gather food during the high tide, eating seaweed that washes up on the shoreline. When they fight, one of the Binacle will move to a different rock!", "220": "Did you know that there are tales about lost people who were saved by the food Delibird has? It carries flood all day long to its awaiting chicks, sometimes using the food as a weapon if it’s attacked. There was once a famous explorer who managed to reach the peak of Mt. Everest thanks to one of these Pokémon sharing its food!", "221": "Did you know that sunlight is the source of Solrock’s power? Rumored to be from this sun, Solrock is a new species of Pokémon that is said to have fallen from space. On sunny days, groups of Solrock line up facing the sun and absorb its light!", "222": "Did you know that what lurks within a Forretress’ armor is a total mystery? Its entire body is shielded by a steel-hard shell, and it will scatter pieces of this shell to drive enemies away. The shell is opened when Forretress is catching prey, but it does so at such a quick pace that the shell’s inside cannot be seen!", "223": "Did you know that no one has ever seen a Komala awake? Komala is born asleep, and it dies asleep. All of its movements are apparently no more than the results of it tossing and turning in its dreams!", "224": "Did you know that Aromatisse can give off a variety of smells, from pleasant fragrance to an odor so repugnant to its opponent that it can turn a battle in its favor? It devises various scents, pleasant and unpleasant, and emits scents that its enemies dislike in order to gain an edge in battle. Its scent is so overpowering that, unless a Trainer happens to really enjoy the smell, he or she will have a hard time walking alongside it!", "225": "Did you know that upon finding a small Pokémon, Leavanny weaves clothing for it from leaves? Using the cutters on its arms and sticky silk, Leavanny not only makes clothing for small Pokémon, but also to make warm wrappings for Sweaddle. This Pokémon keeps its eggs warm with heat from fermenting leaves!", "226": "Did you know that Hatterene is also known as the Forest Witch? It emits psychic power strong enoughto cause headaches as a deterrent to the approach of others. If you’re too loud around it, you risk being torn apart by the claws on its tentacle!", "227": "Did you know that even if Burmy is born where there are no cocooning materials, it somehow always ends up with a cloak? This Pokémon covers itself in a cloak to shelter from the cold, and when it gets warmer, the cloak gets thinner. If its cloak is broken in battle, Burmy quickly remakes the cloak with materials nearby!", "228": "Did you know that Machamp has the power to hurl anything aside? Using its heavy muscles, it throws powerful punches that can send the victim clear over the horizon. One arm alone can move mountains!", "229": "Did you know that possessed people controlled by Palossand transformed its sand mound into a castle? This Pokémon eats small Pokémon and siphons away their vital essence while they’re still alive. Buried beneath the castle are masses of dried-up bones from those whose vitality it drained!", "230": "Did you know that Loudred’s bellowing can completely decimate a wood-frame house? When its stamps its feet and bellows, it generates ultrasonic waves from its speaker-like ears. After it finishes shouting, this Pokémon becomes incapable of hearing anything for a while!", "231": "Did you know that when Dragapult isn’t battling, it keeps Dreepy in the holes on its horns? Once a fight starts, it launches the Dreepy like supersonic missiles. Apparently the Dreepy inside Dragapult’s horns eagerly look forward to being launches out at Mach speeds!", "232": "Did you know that because of the way Drifloon floats aimlessly, an old folktale calls it a “Signpost for Wandering Spirits”? A Pokémon formed by the spirits of people and Pokémon, it tugs on the hands of children to steal them away. Its round body is stuffed with souls and expands each time it leads someone away!", "233": "Did you know that the fruit around Tropius’ neck only grows twice a year? This Pokémon loves fruit, and eats it continuously. Apparently, its love for fruit resulted in its own outgrowth of fruit!", "234": "Did you know that an Alakazam’s brain can outperform a supercomputer? Its intelligence quotient is said to be 5,000, and it can memorize anything it sees. It never forgets what it learns -- that’s why this Pokémon is so smart!", "235": "Did you know that with sly cunning, Morgrem tries to lure people into the woods? When it gets down on all fours as if to beg for forgiveness, it’s trying to lure opponents in so that it can stab the with its spear-like hair. Some believe that this Pokémon has the ability to make crops grow!", "236": "Did you know that when attacked, Cottonee escapes by shooting cotton from its body? The cotton serves as a decoy to distract the attacker, and they go wherever the wind takes them. Perhaps because they feel more at ease in a group, they stick to others they find!", "237": "Did you know that in times long past, governors of castles would invite Florges to create flower gardens to embellish the castle domains? This Pokémon claims exquisite flower gardens as its territory, and it obtains power form basking in the energy emitted by flowering plants. It’s said to devote its entire life to protecting gardens!", "238": "Did you know that Quagsire often bangs its head on the river bottom? Due to its relaxed and carefree attitude, it also bumps its head on boulders and boat hulls as it swims. With its carefree and sluggish nature, it never seems to care when it bumps its head!", "239": "Did you know that Mareanie plunges the poison spike on its head into its prey? The first symptom of its sting is numbness, and the next is an itching sensation so intense that it’s impossible to resist the urge to claw at your skin. When the prey has weakened, Mareanie deals the finishing blow with its 10 tentacles!", "240": "Did you know that by using the feelers on its ears, Audino can tell how someone is feeling or when an egg might hatch? This Pokémon touches others with the feelers on its ears, using the sound of their heartbeats to tell how they are feeling. With its astounding auditory sense, not even a pebble rolling along over a mile away will escape Audino’s ears!", "241": "Did you know that Hattrem uses the braids on its head to pummel foes in order to quiet them down? No matter who you are, if you bring strong emotions near this Pokémon, it will silence you violently. One blow from those braids would knock out a professional boxer!", "242": "Did you know that when Dewpider comes across enemies or potential prey, it smashes its water-bubble-covered head into them? While it normally lives underwater, it crawls onto the land in search of food. It forms a water bubble at the rear of its body and then covers its head with it!", "243": "Did you know that Growlithe will bark fiercely at anything invading its territory? Very protective by nature, this Pokémon will bark and bite to repel intruders from its space. Also extremely loyal, it will fearlessly bark at any opponent to protect its own trainer from harm!", "244": "Did you know that when the twig is plucked from Braixen’s tail, friction sets the twig alight? At this stage, Braixen no longer eats branches, but it still keeps a tree branch in its tail, which seems to calm it. It will occasionally wield the branch in battle!", "245": "Did you know that Murkrow and Meowth loot one another’s stashes? It hides any shiny object it finds in a secret location, and it shows strong interest in anything that sparkles or glitters. It will even try to steal rings from women!", "246": "Did you know that Shuppet is attracted by feelings of jealousy and vindictiveness? If someone develops strong feelings of vengeance, this   Pokémon will appear in a swarm and line up beneath the the eaves of that person’s home. It roams through cities in search of grudges that taint people!", "247": "Did you know that Skorupi can survive a year without food? Due to it living in arid regions, it will bury itself in the sand and lay in wait for unsuspecting prey. Its tail claws can inject its prey with a savage poison, and it tenaciously hangs on until the poison takes effect!", "248": "Did you know that while normally patient by nature, Gumshoos loses control of itself and pounces when it spots its favorite meal - Rattata? Although it wasn’t originally found in Alola, this Pokémon was brought over a long time ago when there was a huge Rattata outbreak. It adores having Rattata and Raticate for dinner, but as it’s diurnal, it never encounters them!", "249": "Did you know that Azurill battles by flinging around its tail? This Pokémon spins its tail as if it were a lasso, then hurls it as far as it can. The momentum of this throw sends its body flying, too!", "250": "Did you know that Hippowdon will hold its mouth agape as a display of strength? Its huge mouth is almost seven feet across and has enough power to completely crush a car. When roused to violence by its rage, it spews out the quantities of sand it has swallowed and whips up a sandstorm!", "251": "Did you know that while its usually docile, if you disturb a Heracross sipping on honey, it will chase you off with its horn? With its Herculean powers, it can easily throw around an object that is 100 times its own weight. Heracross is capable of generating enough power to hurl foes over great distances!", "252": "Did you know that starlight is the source of Gothorita’s power? At night, they mark star positions by using psychic power to float stones. It’s said that when stars shine in the night sky, this Pokémon will spirit away sleeping children!", "253": "Did you know that when Poliwhirl is under attack, it uses its belly spiral to put the foe to sleep? The swirl on its belly subtly undulates and staring at may gradually cause drowsiness. Once the enemy fall asleep, it makes its escape!", "254": "Did you know that if its fleece grows too long, Wooloo won’t be able to move? Cloth made with the wool of this Pokémon is surprisingly strong. Its curly fleece is such an effective cushion that this Pokémon could fall off a cliff and stand right back up at the bottom, unharmed!", "255": "Did you know that Skiddo are thought to be one of the first Pokémon to live in harmony with humans? A Pokémon with a placid disposition, Skiddo has become able to read the feelings of its riders through their grip on its horns. If it has sunshine and water, it doesn’t need to eat, because Skiddo can generate energy from the leaves on its back!", "256": "Did you know that no two Spinda are said to have identical patterns? All the Spinda that exist in the world are said to have utterly unique spot patterns, and the odds of two Spinda having identical spot patterns is less than one in four billion. There are collectors who enjoy the tiny differences in their spot patterns!", "257": "Did you know that due to the danger that this synthetic Pokémon may go on a rampage, Type: Null wears a control mask to restrain its power? The heavy mask it wears suppresses its intrinsic capabilities as well as slowing its movements. A Pokémon weapon developed for a specific mission, it went berserk during an experiment, so it was cryogenically frozen!", "258": "Did you know that if static electricity builds in Mareep’s body, its fleece doubles in volume? This fleece grows continually, but there is a lot of air within that coat, allowing it to stay cool in summer and warm in winter. During the summer, the fleece will fully shed, but it grows back in a week!", "259": "Did you know that Grimer thrives by sucking up polluted sludge that is pumped out of factories? Smelling too putrid to touch, even weeds won’t grow in this Pokémon's path. Wherever Grimer has passed, so many germs are left behind that no plants will ever grow again!", "260": "Did you know that the richer the whipped cream that Alcremie produces, the happier it is? Desserts made using this cream are invariably delicious, so many pastry chefs strive to have an Alcremie as their partner. When it trusts a Trainer, this Pokémon will treat them to berries it’s decorated with cream!", "261": "Did you know that by swallowing large amounts of water, Vanilluxe can make snow clouds inside their bodies? If both heads get angry simultaneously, they will then use these snow clouds to attack foes with violent blizzards, burying everything in snow. Vanilluxe can create snow anywhere, so it gets a lot of love from skiers and snowboarders!", "262": "Did you know that Happiny carries an egg-shaped rock in imitation of Chansey? Happiny loves round white things, and believes that the round, white rock that it carries is an egg. If it gets along well with someone, it will sometimes give that person the rock!", "263": "Did you know that the shock of its bouncing makes Spoink’s heart pump? As a result, this Pokémon cannot afford to stop bouncing, because if it stops, its heart will stop. As a result, Spoink doesn’t ever stop bouncing, even while its asleep!", "264": "Did you know that as Silicobra digs, it swallows the sand and stores it in its neck pouch? This Pokémon can carry more than 17 pounds of sand at once, and can move quite easily even with all that weight. It uses this sand blind its enemies, giving it an opportunity to burrow in the ground to hide!", "265": "Did you know that Yamask retains the memories of its former life? The mask this Pokémon is seen carrying around is its face from its time as a human, and there are times where it will look at it and cry. It will ramble through ruins, searching for someone who knows its face!", "266": "Did you know that there is a legend that says Kommo-o is covered in glittering scales in order to drive away a great darkness covering the world? It goes on to theorize that the reason these Pokémon seek out battles are to gain the power needed to defeat this darkness. When Kommo-o howls after finishing off its prey, the metallic sounds of its celebration can be heard from all around!", "267": "Did you know that Slurpuff’s sense of smell is a hundred million times more sensitive than that of a humans? With its highly attuned senses, it can distinguish even the faintest of odors, so all the various smells tells it about everything in the area. It can even sniff out a person’s mental and physical condition by taking in their scent!", "268": "Did you know that to fire its poison spikes, Qwilfish must inflate its body by drinking over 2.6 gallons of water at once? When facing a larger opponent, it will swallow as much water as it can to match the opponent’s size. The small spikes covering its body developed from scales, and they inject a toxin that causes fainting, so be careful when handling this Pokémon!", "269": "Did you know that once it strikes, Golbat will not stop draining energy from the victim, even if it gets too heavy to fly? This Pokémon attacks in a stealthy manner, without warning, and will use its sharp fangs to bite and suck blood from its target. However hard its victims’ hide may be, it punctures with its fangs and gorges itself with blood!", "270": "Did you know that a single Heliolisk can generate sufficient electricity to power a skyscraper just by flaring its frill? This   Pokémon stimulates its muscles with electricity, boosting the strength in its legs and enabling it to run 100 yards in five seconds. One Heliolisk basking in the sun with its frill outspread is all it would take to produce enough electricity to power a city!", "271": "Did you know that the shell on Turtonator’s back is chemically unstable and explodes violently if struck? Due to its diet of sulfur and other minerals, both its shell and droppings are highly explosive. When hunting, this Pokémon will strike its shell with its tail to trigger an explosion!", "272": "Did you know that Castform’s feelings change with the weather? Well known for its weather-based appearance, this Pokémon gained the ability to use the vast power of nature to protect its tiny body. Recently, its molecules were found to be just like water!", "273": "Did you know that the armor Escavalier wears is the stolen shell of a Shelmet? This steel armor protects their whole body, and they defend themselves and attack with its two lances. Even when in trouble, they face their opponents bravely!", "274": "Did you know that Misdreavus loves to watch people it’s scared? This Pokémon likes to play mischievous tricks such as wailing to startle people at night and yank people’s hair from behind without warning. Apparently, the red spheres around its neck absorb these feelings of fear to turn them into nutrition for itself!", "275": "Did you know that Drednaw’s fangs are strong and sharp enough to bite through rock and iron? With jaws that can shear through steel rods, this highly aggressive Pokémon chomps down on its unfortunate prey. Drednaw can also rapidly extend its retractable neck to sink its sharp fangs into distant enemies and taken them down!", "276": "Did you know that Skuntank can spray a vile-smelling liquid from the tip of its tail? Even though this fluid smells worse the longer it is allowed to fester, the potency of the smell dims after a few squirts. Skuntank can spray this liquid over 160 feet, so be careful when approaching this Pokémon!", "277": "Did you know that the light on Litwick’s head shines brighter and eerier the younger the life this Pokémon absorbs? While shining this light and pretending to be a guide, it leeches off the life force of any who follow it. This Pokémon in particular is known for taking lost children by the hand to guide them to the spirit world!", "278": "Did you know that Trapinch’s giant jaws have enough strength to crush even boulders? A very patient Pokémon, Trapinch will dig an inescapable pit in a desert and wait for its prey to come tumbling down. Once something falls into its trap, there’s no escape!", "279": "Did you know that in a south sea nation, there are people that live in communities built on groups of Corsola? Clusters of Corsola congregate to warm seas where they serve as ideal hiding places for smaller Pokémon. Their branches glitter very beautifully in seven colors when they catch sunlight, and the tip of its head is prized as a treasure for its beauty!", "280": "Did you know that Pyroar’s fiery breath can reach temperatures of over 10,000 degrees Fahrenheit? Mostly for show, Pyroar will usually use this breath to viciously threaten any challengers. The male Pyroar in particular are known for being lazy, but when attacked by a strong foe, they will protect its friends with no regard for its own safety!", "281": "Did you know that in times of desperation, Crabominable can lop off its own pincers and fire them like rockets? This Pokémon stores coldness in its pincers to pummel its foes, having enough power to smash thick walls of ice to bits. There are records of its turning back avalanches with a flurry of punches!", "282": "Did you know that as a slow walker, Graveler prefer to roll down slopes to move? Often seen rolling down mountain trails, this Pokémon pays no attention to any object that happens to be in its path. After all, with its free and uncaring nature, obstacles are just things to roll straight over, not avoid!", "283": "Did you know that with the hair wrapped around its body helping to enhance its muscles, Grimmsnarl can overwhelm even a Pokémon like Machamp? Its hairs work like muscle fibers, and when its hairs unfurl, they latch on to opponents, ensnaring them as tentacles would. Grimmsnarl is capable of moving this hair around to its whims, so make sure to keep an eye on it while battling!", "284": "Did you know that somewhere in the world is a cemetery just for Marowak? The bone it chooses is its key weapon, and Marowak is capable of throwing said bone skillfully like a boomerang to KO its targets. This Pokémon has also been seen pounding boulders with the bone it carries in order to tap out messages to others!", "285": "Did you know that Bonsly’s crying is actually not crying at all? Bonsly live in arid environments, and it leaks water from its eyes to adjust its body’s fluid levels. Bonsly does not deal with water well, and if its body gets too damp, it will die!", "286": "Did you know that Sawsbuck will migrate according to the seasons? One glance at a Sawsbuck’s horns can tell you what the season was, as the horns change according to the season. Due to these migration patterns, Sawsbuck have also been called the harbingers of spring!", "287": "Did you know that for some reason, only female Salazzles have been found? These females create a reverse harem of male Salandit by emitting a gas laden with pheromones to captivate them. Salazzle live deep in caves and forces the Salandit it has attracted with its pheromones to serve it!", "288": "Did you know that Illumise can attract Volbeat by using a sweet fragrance? Once the Volbeat have gathered, this Pokémon leads the lit-up swarm in drawing geometric patterns in the night sky, earning respect from its peers the more complex the design is. Scientists that study these patterns say there are over 200 confirmed patterns so far!", "289": "Did you know that because Aipom uses its tail so much, its real hands have become rather clumsy? This hand-like tail can be cleverly manipulated to Aipom’s needs, and its powerful enough that it can grab a tree branch and hold itself up in the air with ease. Since this Pokémon lives atop tall trees, Aipom also uses this tail for balance!", "290": "Did you know that if something happens that Tyrunt doesn’t like, it will throw a tantrum and run wild? A spoiled and selfish Pokémon, Tyrunt likes to be pampered and revered by its trainer. With its violent disposition, it can also inflict grievous wounds on its Trainer just by playing around, so be careful when handling or training them!", "291": "Did you know that through the bond it forms with its Trainer, Silvally will grow stronger and destroy the control mask it wears as a Type: Null? Although called Type: Null at first, the boy who evolved it into this form gave it the name by which it is now known. Only a solid bond of trust between Silvally and its Trainer can awaken its hidden power!", "292": "Did you know that once attacked, Wobbuffet will inflate its body to pump up its counterstrike? Never the first to attack, this Pokémon certainly lives up to its moniker as the Patient Pokémon. If two or more Wobbuffet meet, they will turn competitive and try to outdo each other’s endurance!", "293": "Did you know that Paras will burrow under the ground to gnaw on tree roots? As it sucks on the roots, the mushrooms on its back absorb most of the nutrition and grow larger. These mushrooms, also known as tochukaso mushrooms, are highly valued as medicine for extending life!", "294": "Did you know that Carracosta will eat every last bite of the prey it catches, even the shells and bones? This Pokémon is capable of eating Omastar and Omanyte whole and not be bothered in the slightest by their shells. Its incredible jaw strength allows them to chew up steel beams and rocks along with their prey, enhancing the strength of its own shell!", "295": "Did you know that Milcery are born from sweet-smelling particles in the air? Its body is made completely of cream, adding to its sweet-smelling nature. It’s said that any patisserie visited by a Milcery is guaranteed success and good fortune!", "296": "Did you know that Heatran’s body circulates magma rather than blood through its body? With its body being made of rugged steel, it is partially melted in spots due to the heat permeating from within its body. It dwells in volcanic caves, where it digs in with its cross-shaped feet to crawl along the ceilings and walls!", "297": "Did you know that Flygon is also known as “The Desert Spirit”? Flygon is capable of whipping up a sandstorm by flapping its wings, and the flapping sounds like a series of notes that could be misconstrued as a woman's singing. It seldom appears where people can see it, so if you manage to spot one, count yourself lucky!", "298": "Did you know that Espeon uses the fine hair that covers its body to sense air currents and predict its enemy’s actions? The tip of its forked tail quivers when it is predicting its opponent’s next move. By reading the air currents, it can predict things such as the weather or its foe’s next move!", "299": "Did you know that Electrode amuses itself by exploding? This Pokémon can store electric energy under very high pressures, where even the slightest shock could trigger a massive explosion. The more energy it stores up, the faster and more likely to explode it gets!", "300": "Did you know that Vanillish has existed since the Ice Age? At that time, they moved to southern areas, where they would live in the snowy mountains. They can conceal themselves from enemy eyes by creating many small ice particles and hiding among them!"}